# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 2  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_DCMB, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_DCMB, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_DCMB, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DCMB, [384]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, TransformerEncoderLayer_Pola_SEFN_Mona_DyT, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [-1, 1, ELA_HSFPN, []] # 12
  - [-1, 1, nn.Conv2d, [256, 1]] # 13
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 14

  - [5, 1, ELA_HSFPN, []] # 15
  - [-1, 1, nn.Conv2d, [256, 1]] # 16
  - [14, 1, ELA_HSFPN, [False]] # 17
  - [[-1, -2], 1, Multiply, []] # 18
  - [[-1, 14], 1, Add, []] # 19
  - [-1, 3, RepC3, [256, 0.5]] # 20 P4/16

  - [14, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1, 16]] # 21
  - [3, 1, ELA_HSFPN, []] # 22
  - [-1, 1, nn.Conv2d, [256, 1]] # 23
  - [21, 1, ELA_HSFPN, [False]] # 24
  - [[-1, -2], 1, Multiply, []] # 25
  - [[-1, 21], 1, Add, []] # 26
  - [-1, 3, RepC3, [256, 0.5]] # 27 P3/8

  - [[27, 20, 13], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)